nxp-appcodehub/an-bidirectional-dcdc-mc56f83783/Bidir_DCDC_MC56F83783/board/pin_mux.h
/*! @name GPIOC1 (number 4), LED_HVP
  @{ */
#define BDM_CONFIG_PIN_DEINIT_LED_HVP_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BDM_CONFIG_PIN_DEINIT_LED_HVP_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define BDM_CONFIG_PIN_DEINIT_LED_HVP_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name GPIOC5 (number 18), XBAR_TP2
  @{ */
#define BDM_CONFIG_PIN_DEINIT_XBAR_TP2_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BDM_CONFIG_PIN_DEINIT_XBAR_TP2_PIN 5U              /*!<@brief GPIOC pin index: 5 */
#define BDM_CONFIG_PIN_DEINIT_XBAR_TP2_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name GPIOC8 (number 33), User_LED1
  @{ */
#define BDM_CONFIG_PIN_DEINIT_User_LED1_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define BDM_CONFIG_PIN_DEINIT_User_LED1_PIN 8U              /*!<@brief GPIOC pin index: 8 */
#define BDM_CONFIG_PIN_DEINIT_User_LED1_PIN_MASK kGPIO_Pin8 /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name GPIOC13 (number 49), XBAR_TP1
  @{ */
#define BDM_CONFIG_PIN_DEINIT_XBAR_TP1_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BDM_CONFIG_PIN_DEINIT_XBAR_TP1_PIN 13U              /*!<@brief GPIOC pin index: 13 */
#define BDM_CONFIG_PIN_DEINIT_XBAR_TP1_PIN_MASK kGPIO_Pin13 /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name GPIOC15 (number 56), STB_EN
  @{ */
#define BDM_CONFIG_PIN_DEINIT_STB_EN_GPIO GPIOC           /*!<@brief GPIO device name: GPIOC */
#define BDM_CONFIG_PIN_DEINIT_STB_EN_PIN 15U              /*!<@brief GPIOC pin index: 15 */
#define BDM_CONFIG_PIN_DEINIT_STB_EN_PIN_MASK kGPIO_Pin15 /*!<@brief PORT pin mask */
                                                          /* @} */

/*!
 * @brief This is a de-initialization function for 'BDM_Config_Pin' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BDM_Config_Pin_deinit(void);

/*! @name GPIOC1 (number 4), LED_HVP
  @{ */
#define COMMON_CONFIG_PIN_LED_HVP_GPIO GPIOC          /*!<@brief GPIO device name: GPIOC */
#define COMMON_CONFIG_PIN_LED_HVP_PIN 1U              /*!<@brief GPIOC pin index: 1 */
#define COMMON_CONFIG_PIN_LED_HVP_PIN_MASK kGPIO_Pin1 /*!<@brief PORT pin mask */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Common_Config_Pin(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
